       IDENTIFICATION DIVISION.
       PROGRAM-ID. basico.
       AUTHOR. Rafael.
       PROCEDURE DIVISION.
       000-INICIO.
           DISPLAY "OLA MUNDO".
           STOP RUN.
